Tekla.Structures.ModelInternal.dotComponentInputObject_t
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotComponentInputObject_t.InputType
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotComponentInputObject_t.nPoints
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotComponentInputObject_t.aX
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotComponentInputObject_t.aY
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotComponentInputObject_t.aZ
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotComponentInputObject_t.nObjects
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotComponentInputObject_t.aObjects
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotComponentInputObject_t.ComponentId
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotComponentInputObject_t.InputNumber
DO NOT USE! For internal usage only!